app/views/museums/_museum_row.html.erb

        <p> $<%= '%i' % post.price %>
          <% if (defined? post.exhibits.sort.first.price) && post.price != post.exhibits.sort.first.price%>
---
SELECT "exhibits".* FROM "exhibits"