app/views/museums/index.html.erb

SELECT "exhibits".* FROM "exhibits" WHERE "exhibits"."museum_id" = $1  [["museum_id", 1]]
---
											<p> $<%= '%i' % post.price %>
												<% if defined? post.exhibits.sort.first.price %>