app/controllers/carts_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."order_id" = $1 AND "tickets"."paid" = $2  [["order_id", 1], ["paid", false]]
---
  def show
    @tickets = current_order.tickets.where(paid: false)