app/controllers/charges_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @order = Order.find(current_order.id)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @order = Order.find(current_order.id)

UPDATE "tickets" SET "paid" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["paid", true], ["updated_at", 2016-08-18 19:16:20 UTC], ["id", 1]]
---
      )
      @charge = Charge.create!(amount: @final_amount, coupon: @coupon, stripe_id: stripe_charge.id)
      @coupon.update_attributes(quantity_redeemed: @coupon.quantity_redeemed += 1)
      @order.tickets.update(paid: true)