app/controllers/exhibits_controller.rb

SELECT  "exhibits".* FROM "exhibits" WHERE "exhibits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @show_page = true
    @exhibit = Exhibit.find(params[:id])