app/controllers/museums_controller.rb

SELECT "exhibits".* FROM "exhibits" WHERE "exhibits"."museum_id" = $1  [["museum_id", 1]]
SELECT "museums".* FROM "museums"
---
  def index
    @ticket = current_order.tickets.new
    @posts = Museum.all + Exhibit.all + Event.all + Piece.all

SELECT  "museums".* FROM "museums" WHERE "museums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @show_page = true
    @museum = Museum.find(params[:id])

INSERT INTO "museums" ("name", "blurb", "description", "price", "active", "address", "latitude", "longitude", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @museum = Museum.new(museum_params)
    if @museum.save

SELECT  "museums".* FROM "museums" WHERE "museums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "museums" SET "photo_updated_at" = $1, "updated_at" = $2, "photo_file_name" = $3 WHERE "museums"."id" = $4  [["photo_updated_at", 2016-08-12 16:05:39 UTC], ["updated_at", 2016-08-12 16:05:39 UTC], ["photo_file_name", "Brock-Lesnar-signs-WWE-extension.jpg"], ["id", 4]]
---
  def update
    @museum = Museum.find(params[:id])
    if @museum.update(museum_params)

SELECT  "museums".* FROM "museums" WHERE "museums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @museum = Museum.find(params[:id])

SELECT  "museums".* FROM "museums" WHERE "museums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "museums" WHERE "museums"."id" = $1  [["id", 4]]
---
  def destroy
    @museum = Museum.find(params[:id])
    @museum.destroy