app/controllers/tickets_controller.rb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @ticket = Ticket.find(params[:id])

INSERT INTO "orders" ("subtotal", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["subtotal", #<BigDecimal:7fba83740ed8,'0.15E1',18(27)>], ["created_at", 2016-08-17 18:13:17 UTC], ["updated_at", 2016-08-17 18:13:17 UTC]]
INSERT INTO "tickets" ("museum_id", "user_id", "unit_price", "quantity", "order_id", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["museum_id", 2], ["user_id", 1], ["unit_price", 1.5], ["quantity", 1], ["order_id", 1], ["total_price", 1.5], ["created_at", 2016-08-17 18:13:17 UTC], ["updated_at", 2016-08-17 18:13:17 UTC]]
---
  def create
    @order = current_order
    @ticket = @order.tickets.new(ticket_params)
    prng = Random.new
    @ticket.redemption_code = prng.rand(1000000000000).to_s + "MD101"
    @ticket.user_id = current_user.id
    @order.save

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "tickets" SET "quantity" = $1, "order_id" = $2, "total_price" = $3, "updated_at" = $4 WHERE "tickets"."id" = $5  [["quantity", 2], ["order_id", 1], ["total_price", 12.0], ["updated_at", 2016-08-18 21:19:39 UTC], ["id", 2]]
---
  def redeem
    @ticket = Ticket.find(params[:id])
    if @ticket.redeemed == true
      redirect_to tickets_whoops_path
    else
      @ticket.update(redeemed: true)

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."order_id" = $1 AND "tickets"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 5], ["LIMIT", 1]]
UPDATE "tickets" SET "quantity" = $1, "total_price" = $2, "updated_at" = $3 WHERE "tickets"."id" = $4  [["quantity", 3], ["total_price", 66.0], ["updated_at", 2016-08-17 18:26:35 UTC], ["id", 5]]
---
  def update
    @order = current_order
    @ticket = @order.tickets.find(params[:id])
    @ticket.update_attributes(ticket_params)

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."order_id" = $1 AND "tickets"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 1]]
---
  def destroy
    @order = current_order
    @ticket = @order.tickets.find(params[:id])
    @ticket.destroy