app/controllers/users_controller.rb

  def show
    is_user_page
    @user = User.find(params[:id])
    @tickets = Ticket.where(user_id: current_user.id, paid: true, redeemed: false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = $1 AND "tickets"."paid" = $2 AND "tickets"."redeemed" = $3  [["user_id", 1], ["paid", true], ["redeemed", false]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "medici_placeholder.JPG"], ["avatar_file_size", 13450], ["avatar_updated_at", 2016-08-18 17:40:03 UTC], ["updated_at", 2016-08-18 17:40:03 UTC], ["id", 1]]