app/views/layouts/_cart_text.html.erb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."order_id" = $1 AND "tickets"."id" = $2 LIMIT $3  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."order_id" = $1  [["order_id", 1]]
---
<% if number_to_currency current_order.subtotal != 0.00 %>
  <%= link_to "#{current_order.tickets.size} Items in Cart ( #{number_to_currency current_order.subtotal} )", cart_path(id: current_user.id), class: "btn btn-link" %>